In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split,GridSearchCV
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import r2_score,mean_squared_error
import warnings
warnings.filterwarnings("ignore")
from sklearn.preprocessing import MinMaxScaler,StandardScaler,LabelEncoder

In [2]:
data1 = pd.read_csv("ResaleFlatPricesBasedonApprovalDate19901999.csv")
data2 = pd.read_csv("ResaleFlatPricesBasedonApprovalDate2000Feb2012.csv")
data3 = pd.read_csv("ResaleFlatPricesBasedonRegistrationDateFromMar2012toDec2014.csv")
data4 = pd.read_csv("ResaleFlatPricesBasedonRegistrationDateFromJan2015toDec2016.csv")
data5 = pd.read_csv("ResaleflatpricesbasedonregistrationdatefromJan2017onwards.csv")

In [7]:
data4.drop("remaining_lease",axis=1,inplace=True)
data5.drop("remaining_lease",axis=1,inplace=True)

In [3]:
print(data1.shape)
print(data2.shape)
print(data3.shape)
print(data4.shape)
print(data5.shape)

(287196, 10)
(369651, 10)
(52203, 10)
(37153, 11)
(169071, 11)

In [36]:
data = pd.concat([data1,data2,data3,data4,data5],axis=0,ignore_index=True)

In [37]:
data.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,9000.0,NaN
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,6000.0,NaN
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,8000.0,NaN
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,6000.0,NaN
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,47200.0,NaN

In [38]:
data['remaining_lease'] = data['remaining_lease'].fillna(0)

In [39]:
data.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,9000.0,0
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,6000.0,0
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,8000.0,0
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,6000.0,0
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,47200.0,0

In [40]:
data.shape

(915274, 11)

In [41]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 915274 entries, 0 to 915273
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                915274 non-null  object
 1   town                 915274 non-null  object
 2   flat_type            915274 non-null  object
 3   block                915274 non-null  object
 4   street_name          915274 non-null  object
 5   storey_range         915274 non-null  object
 6   floor_area_sqm       915274 non-null  float64
 7   flat_model           915274 non-null  object
 8   lease_commence_date  915274 non-null  int64
 9   resale_price         915274 non-null  float64
 10  remaining_lease      915274 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 76.8+ MB

In [42]:
data.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
remaining_lease        0
dtype: int64

In [43]:
data.duplicated().sum()

1892

In [12]:
data.drop_duplicates(inplace=True)

In [24]:
re = list(data['remaining_lease'].unique())
print(re)

[0.0, 70.0, 65.0, 64.0, 63.0, 62.0, 69.0, 60.0, 61.0, 86.0, 77.0, 80.0, 90.0, 87.0, 66.0, 58.0, 94.0, 71.0, 68.0, 84.0, 73.0, 79.0, 76.0, 72.0, 82.0, 74.0, 67.0, 88.0, 81.0, 89.0, 53.0, 54.0, 55.0, 57.0, 93.0, 83.0, 85.0, 92.0, 91.0, 59.0, 95.0, 52.0, 51.0, 56.0, 75.0, 96.0, 78.0, 50.0, 97.0, 49.0, 48.0, 61.33, 60.58, 62.42, 62.08, 61.5, 58.33, 59.67, 59.5, 62.67, 60.83, 59.25, 61.42, 60.33, 60.25, 63.75, 61.08, 61.83, 58.5, 59.33, 62.92, 60.67, 93.67, 93.58, 60.08, 94.67, 78.33, 60.5, 62.5, 70.67, 63.33, 63.5, 67.58, 61.58, 68.17, 68.25, 67.75, 67.42, 63.58, 66.25, 65.33, 69.42, 59.92, 60.42, 69.17, 69.25, 68.83, 62.83, 64.33, 66.08, 83.08, 87.92, 71.17, 92.33, 54.5, 78.5, 82.92, 75.33, 66.58, 66.5, 75.92, 68.33, 55.75, 68.58, 67.92, 69.08, 69.92, 74.5, 74.33, 69.5, 72.25, 67.17, 66.42, 69.33, 66.92, 66.83, 69.67, 66.75, 67.83, 80.08, 67.5, 86.67, 71.5, 71.25, 67.33, 86.92, 86.83, 79.42, 65.83, 67.25, 79.92, 53.5, 57.17, 52.08, 58.25, 51.5, 58.67, 56.17, 53.67, 64.67, 55.5, 95.58, 55.08, 95.33, 52.5, 57.33, 82.5, 67.67, 95.67, 90.92, 87.83, 82.67, 68.5, 81.17, 56.42, 65.42, 70.75, 71.08, 94.83, 80.25, 83.92, 70.83, 81.08, 70.5, 81.42, 80.58, 80.83, 83.83, 86.75, 79.75, 84.83, 80.92, 70.92, 84.33, 83.75, 81.33, 79.58, 81.25, 70.08, 70.42, 70.58, 56.25, 68.75, 65.25, 59.08, 61.17, 62.33, 71.67, 82.25, 71.33, 75.42, 85.08, 81.75, 72.67, 75.5, 78.25, 82.08, 84.25, 77.42, 77.58, 85.33, 79.33, 78.75, 81.5, 63.67, 62.58, 65.75, 60.17, 88.83, 50.42, 54.92, 59.42, 82.33, 65.58, 72.42, 78.42, 58.58, 80.42, 94.33, 65.17, 71.58, 75.25, 65.08, 79.83, 73.33, 72.33, 74.67, 74.75, 80.17, 81.83, 86.42, 85.5, 79.08, 80.5, 74.92, 68.67, 68.42, 48.75, 63.42, 65.5, 66.33, 67.08, 95.75, 80.75, 82.17, 61.75, 90.58, 57.75, 53.42, 58.83, 92.25, 66.17, 64.25, 72.17, 83.33, 78.58, 84.08, 78.67, 72.83, 71.92, 78.17, 71.42, 72.58, 83.25, 72.92, 90.67, 84.92, 84.75, 82.58, 66.67, 88.33, 85.83, 90.42, 90.5, 83.42, 84.17, 82.75, 82.42, 84.5, 83.58, 52.42, 56.67, 56.5, 68.08, 64.83, 57.08, 86.5, 88.58, 93.92, 58.17, 78.83, 77.67, 75.58, 77.75, 75.67, 77.33, 85.58, 89.58, 91.17, 94.92, 85.92, 94.5, 94.58, 95.08, 95.17, 95.5, 93.17, 86.25, 86.33, 85.25, 86.17, 85.75, 49.08, 57.5, 56.33, 95.25, 88.92, 85.67, 92.58, 83.5, 83.17, 81.92, 94.17, 94.08, 85.42, 85.17, 83.67, 95.83, 93.83, 95.42, 88.08, 94.75, 92.17, 90.33, 91.92, 91.58, 84.67, 84.42, 71.83, 74.83, 69.75, 79.17, 64.75, 79.25, 79.5, 79.67, 69.83, 77.83, 49.42, 52.58, 54.58, 91.25, 59.83, 62.75, 78.08, 71.75, 81.67, 78.92, 74.42, 70.17, 77.17, 70.25, 69.58, 63.17, 59.17, 61.92, 61.25, 60.92, 75.17, 76.83, 57.92, 54.42, 62.25, 59.58, 62.17, 64.42, 63.25, 82.83, 64.92, 74.25, 80.33, 93.5, 68.92, 70.33, 86.58, 57.25, 49.33, 51.42, 52.92, 55.42, 56.92, 87.67, 61.67, 76.92, 77.5, 84.58, 87.08, 59.75, 92.92, 76.75, 88.42, 50.92, 48.92, 58.42, 57.42, 94.25, 74.58, 64.58, 64.08, 80.67, 57.67, 58.75, 53.92, 55.92, 56.08, 88.67, 88.5, 58.92, 76.17, 76.67, 75.75, 77.08, 89.83, 94.42, 92.42, 86.08, 92.5, 92.08, 91.33, 89.5, 90.25, 91.5, 90.83, 77.92, 50.33, 51.92, 58.08, 76.33, 81.58, 65.92, 63.08, 63.83, 93.42, 93.33, 57.83, 55.83, 64.5, 87.75, 64.17, 55.58, 55.67, 74.08, 65.67, 51.33, 54.83, 55.33, 51.83, 92.83, 56.83, 90.75, 87.58, 53.25, 77.25, 50.83, 48.83, 52.83, 93.75, 87.25, 63.92, 75.08, 72.08, 56.58, 57.58, 53.83, 72.75, 75.83, 88.17, 52.25, 54.33, 76.08, 72.5, 89.42, 52.33, 91.75, 90.17, 91.42, 50.25, 51.25, 49.25, 91.08, 76.25, 60.75, 54.25, 52.75, 55.25, 54.75, 87.5, 92.75, 76.58, 88.75, 50.17, 53.75, 52.17, 50.75, 56.75, 76.5, 89.67, 51.75, 89.25, 91.67, 89.33, 90.08, 51.17, 49.17, 74.17, 93.25, 54.17, 73.92, 51.67, 54.67, 87.42, 92.67, 52.67, 48.67, 50.67, 50.08, 73.17, 55.17, 88.25, 89.17, 91.83, 53.17, 51.08, 54.08, 73.83, 50.58, 53.08, 87.33, 48.58, 51.58, 96.67, 89.08, 76.42, 53.58, 93.08, 48.5, 50.5, 73.08, 89.92, 96.58, 73.75, 73.67, 87.17, 49.83, 48.42, 96.5, 89.75, 49.92, 73.58, 48.33, 49.75, 53.33, 96.42, 73.5, 48.25, 49.67, 96.33, 49.58, 48.17, 96.25, 73.42, 48.08, 49.5, 96.17, 47.75, 96.08, 47.92, 95.92, 47.83, 73.25, 47.67, 47.33, 47.58, 47.5, 47.42, 47.17, 47.25, 47.08, 47.0, 46.92, 46.83, 46.75, 46.67, 46.58, 46.5, 46.25, 46.42, 46.33, 46.08, 46.17, 46.0, 45.75, 45.92, 45.83, 45.58, 45.67, 97.08, 45.5, 97.75, 45.42, 45.33, 97.58, 45.25, 45.17, 96.75, 45.08, 44.83, 97.42, 97.33, 97.25, 97.17, 45.0, 96.92, 96.83, 44.75, 44.67, 44.58, 44.92, 44.5, 44.42, 44.33, 44.25, 44.17, 44.08, 44.0, 43.92, 43.83, 43.75, 43.67, 43.58, 43.5, 43.42, 43.33, 43.25, 43.08, 43.17, 43.0, 42.92, 42.67, 42.58, 42.83, 42.75, 42.5, 42.42, 42.33, 42.25, 42.17, 42.08]

In [27]:
data['remaining_lease'].dtypes

dtype('float64')

In [44]:
def convert_year(x):
    year = 0
    if type(x) == int:
        return x
    if type(x) == str:
        s = x.split()        
        if len(s) == 4:
            year += int(s[0])
            month = int(s[2])
            year += round(month/12,2)
        if len(s) == 2:
            year += int(s[0])       
    return year
convert_year(86)

86

In [45]:
data['remaining_lease'] = data['remaining_lease'].apply(convert_year)

In [53]:
data['resale_year'] = pd.to_datetime(data['month'], format="%Y-%M").dt.year
data['resale_month'] = pd.to_datetime(data['month'], format="%Y-%M").dt.month

In [54]:
data.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,storey_low,storey_up,resale_year,resale_month
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,9000.0,0.0,10,12,1990,1
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,6000.0,0.0,4,6,1990,1
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,8000.0,0.0,10,12,1990,1
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,6000.0,0.0,7,9,1990,1
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,47200.0,0.0,4,6,1990,1

In [48]:
data['storey_range'].unique()

array(['10 TO 12', '04 TO 06', '07 TO 09', '01 TO 03', '13 TO 15',
       '19 TO 21', '16 TO 18', '25 TO 27', '22 TO 24', '28 TO 30',
       '31 TO 33', '40 TO 42', '37 TO 39', '34 TO 36', '06 TO 10',
       '01 TO 05', '11 TO 15', '16 TO 20', '21 TO 25', '26 TO 30',
       '36 TO 40', '31 TO 35', '46 TO 48', '43 TO 45', '49 TO 51'],
      dtype=object)

In [50]:
def low(x):
    if type(x) == str:
        s = x.split('TO')
        return int(s[0])
def up(x):
    if type(x) == str:
        s = x.split('TO')
        return int(s[1])
low('10 TO 12')
up('10 TO 12')

12

In [51]:
data['storey_low'] = data['storey_range'].apply(low)
data['storey_up'] = data['storey_range'].apply(up)

In [52]:
data.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,storey_low,storey_up
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,9000.0,0.0,10,12
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,6000.0,0.0,4,6
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,8000.0,0.0,10,12
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,6000.0,0.0,7,9
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,47200.0,0.0,4,6

In [55]:
data.drop(['month','storey_range'],axis=1,inplace=True)

In [57]:
data.to_csv("resale.csv")

In [56]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 915274 entries, 0 to 915273
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   town                 915274 non-null  object
 1   flat_type            915274 non-null  object
 2   block                915274 non-null  object
 3   street_name          915274 non-null  object
 4   floor_area_sqm       915274 non-null  float64
 5   flat_model           915274 non-null  object
 6   lease_commence_date  915274 non-null  int64
 7   resale_price         915274 non-null  float64
 8   remaining_lease      915274 non-null  float64
 9   storey_low           915274 non-null  int64
 10  storey_up            915274 non-null  int64
 11  resale_year          915274 non-null  int32
 12  resale_month         915274 non-null  int32
dtypes: float64(3), int32(2), int64(3), object(5)
memory usage: 83.8+ MB

In [58]:
for col in data.columns:
    if data[col].dtypes == "object":
        data[col] = pd.Categorical(data[col]).codes

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 915274 entries, 0 to 915273
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   town                 915274 non-null  int8
 1   flat_type            915274 non-null  int8
 2   block                915274 non-null  int16
 3   street_name          915274 non-null  int16
 4   floor_area_sqm       915274 non-null  float64
 5   flat_model           915274 non-null  int8
 6   lease_commence_date  915274 non-null  int64
 7   resale_price         915274 non-null  float64
 8   remaining_lease      915274 non-null  float64
 9   storey_low           915274 non-null  int64
 10  storey_up            915274 non-null  int64
 11  resale_year          915274 non-null  int32
 12  resale_month         915274 non-null  int32
dtypes: float64(3), int16(2), int32(2), int64(3), int8(3)
memory usage: 55.0 MB

In [60]:
data.head()

,town,flat_type,block,street_name,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,storey_low,storey_up,resale_year,resale_month
0,0,0,829,13,31.0,7,1977,9000.0,0.0,10,12,1990,1
1,0,0,829,13,31.0,7,1977,6000.0,0.0,4,6,1990,1
2,0,0,829,13,31.0,7,1977,8000.0,0.0,10,12,1990,1
3,0,0,829,13,31.0,7,1977,6000.0,0.0,7,9,1990,1
4,0,2,447,13,73.0,20,1976,47200.0,0.0,4,6,1990,1

In [61]:
x = data.drop('resale_price',axis=1)
y = data.pop('resale_price')

In [62]:
x.head()

,town,flat_type,block,street_name,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,storey_low,storey_up,resale_year,resale_month
0,0,0,829,13,31.0,7,1977,0.0,10,12,1990,1
1,0,0,829,13,31.0,7,1977,0.0,4,6,1990,1
2,0,0,829,13,31.0,7,1977,0.0,10,12,1990,1
3,0,0,829,13,31.0,7,1977,0.0,7,9,1990,1
4,0,2,447,13,73.0,20,1976,0.0,4,6,1990,1

In [63]:
y.head()

0     9000.0
1     6000.0
2     8000.0
3     6000.0
4    47200.0
Name: resale_price, dtype: float64

In [64]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.3,random_state=1)

In [65]:
dtr = DecisionTreeRegressor()
model = dtr.fit(xtrain,ytrain)

In [66]:
pred = model.predict(xtest)
print(r2_score(ytest,pred))

0.9649075208668497

In [67]:
pred1 = model.predict(xtrain)
print(r2_score(ytrain,pred1))

0.9983148446940033

In [69]:
from joblib import dump

In [70]:
dump(model,"resalemodel.joblib")

['resalemodel.joblib']

In [16]:
data = pd.read_csv('resale.csv')
data.head()

,Unnamed: 0,town,flat_type,block,street_name,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,storey_low,storey_up,resale_year,resale_month
0,0,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,9000.0,0.0,10,12,1990,1
1,1,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,6000.0,0.0,4,6,1990,1
2,2,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,8000.0,0.0,10,12,1990,1
3,3,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,6000.0,0.0,7,9,1990,1
4,4,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,73.0,NEW GENERATION,1976,47200.0,0.0,4,6,1990,1

In [18]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [19]:
data.head()

,town,flat_type,block,street_name,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,storey_low,storey_up,resale_year,resale_month
0,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,9000.0,0.0,10,12,1990,1
1,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,6000.0,0.0,4,6,1990,1
2,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,8000.0,0.0,10,12,1990,1
3,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,31.0,IMPROVED,1977,6000.0,0.0,7,9,1990,1
4,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,73.0,NEW GENERATION,1976,47200.0,0.0,4,6,1990,1

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 915274 entries, 0 to 915273
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   town                 915274 non-null  object
 1   flat_type            915274 non-null  object
 2   block                915274 non-null  object
 3   street_name          915274 non-null  object
 4   floor_area_sqm       915274 non-null  float64
 5   flat_model           915274 non-null  object
 6   lease_commence_date  915274 non-null  int64
 7   resale_price         915274 non-null  float64
 8   remaining_lease      915274 non-null  float64
 9   storey_low           915274 non-null  int64
 10  storey_up            915274 non-null  int64
 11  resale_year          915274 non-null  int64
 12  resale_month         915274 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 90.8+ MB

In [14]:
print(data['flat_model'].nunique())
town = list(data['flat_model'].unique())
town.sort()
print(town)

34
['2-ROOM', '2-room', '3Gen', 'APARTMENT', 'Adjoined flat', 'Apartment', 'DBSS', 'IMPROVED', 'IMPROVED-MAISONETTE', 'Improved', 'Improved-Maisonette', 'MAISONETTE', 'MODEL A', 'MODEL A-MAISONETTE', 'MULTI GENERATION', 'Maisonette', 'Model A', 'Model A-Maisonette', 'Model A2', 'Multi Generation', 'NEW GENERATION', 'New Generation', 'PREMIUM APARTMENT', 'Premium Apartment', 'Premium Apartment Loft', 'Premium Maisonette', 'SIMPLIFIED', 'STANDARD', 'Simplified', 'Standard', 'TERRACE', 'Terrace', 'Type S1', 'Type S2']

In [25]:
data['floor_area_sqm'].max()

307.0